// TODO: 我们通常建议您多在谜题中尝试新东西，如果您已经成功解谜且满意于您的修改，
// 就可以按 `n` 键进行下一个谜题
//
// 谜题在保存后会自动检查错误！
// 试试增加一行 `println!` 并且在控制台检查输出。

fn main() {
    println!(r#"       欢迎使用                           "#);
    println!(r#"                 _   _ _                  "#);
    println!(r#"  _ __ _   _ ___| |_| (_)_ __   __ _ ___  "#);
    println!(r#" | '__| | | / __| __| | | '_ \ / _` / __| "#);
    println!(r#" | |  | |_| \__ \ |_| | | | | | (_| \__ \ "#);
    println!(r#" |_|   \__,_|___/\__|_|_|_| |_|\__, |___/ "#);
    println!(r#"                               |___/      "#);
    println!();
    println!("本谜题已经编译成功，剩下的谜题中可能存在编译器或逻辑错误。");
    println!("请修复这些错误，并且完成谜题。祝您好运！");
    println!();
    println!("第一个谜题是 `exercises/00_intro/intro1.rs`，请打开看看吧。");
    println!("当前的解谜进度会一直显示在下方。");
    println!("若您的编辑器支持，可以点击上方的文件路径，进入对应的文件。");
}
